import xlrd
import xlsxwriter
import random
import os

class excel_edit():
    # def __int__(self):
    #     self.path="newexcel.xlsx"
    #     self.sheetname="sheet1"

    def add_data(self,excelpath,excelsheetname):
        workbook = xlsxwriter.Workbook(excelpath)
        worksheet = workbook.add_worksheet(excelsheetname)

        path1 = os.path.realpath(excelpath)

        headings = ['no', 'name']
        worksheet.write_row('A1', headings)
        fst_name = ['赵', '钱', '孙', '李', '周', '吴', '郑', '王', '冯', '陈', '褚', '卫', '蒋', '沈', '韩', '杨', '朱', '秦', '尤', '许',
                    '何', '吕', '施', '张', '孔',
                    '曹', '严', '华', '金', '魏', '陶', '姜', '戚', '谢', '邹', '喻', '柏', '水', '窦', '章', '云', '苏', '潘', '葛', '奚',
                    '范', '彭', '郎', '鲁', '韦',
                    '昌', '马', '苗', '凤', '花', '方', '俞', '任', '袁', '柳', '酆', '鲍', '史', '唐', '费', '廉', '岑', '薛', '雷', '贺',
                    '倪', '汤', '滕', '殷', '罗',
                    '毕', '郝', '邬', '安', '常', '乐', '于', '时', '傅', '皮', '卞', '齐', '康', '伍', '余', '元', '卜', '顾', '孟', '平',
                    '黄', '和', '穆', '萧', '尹',
                    '姚', '邵', '湛', '汪', '祁', '毛', '禹', '狄', '米', '贝', '明', '臧', '计', '伏', '成', '戴', '谈', '宋', '茅', '庞',
                    '熊', '纪', '舒', '屈', '项', '祝',
                    '董', '梁', '杜', '阮', '蓝', '闵', '席', '季', '麻', '强', '贾', '路', '娄', '危', '江', '童', '颜', '郭', '梅', '盛',
                    '林', '刁', '钟', '徐', '邱', '骆',
                    '高', '夏', '蔡', '田', '樊', '胡', '凌', '霍', '虞', '万', '支', '柯', '昝', '管', '卢', '莫', '经', '房', '裘', '缪',
                    '干', '解', '应', '宗', '丁', '宣', '贲',
                    '邓', '郁', '单', '杭', '洪', '包', '诸', '左', '石', '崔', '吉', '钮', '龚', '程', '嵇', '邢', '滑', '裴', '陆', '荣',
                    '翁', '荀', '羊', '於', '惠', '甄', '麴',
                    '家', '封', '芮', '羿', '储', '靳', '汲', '邴', '糜', '松', '井', '段', '富', '巫', '乌', '焦', '巴', '弓', '牧', '隗',
                    '山', '谷', '车', '侯', '宓', '蓬', '全',
                    '郗', '班', '仰', '秋', '仲', '伊', '宫', '宁', '仇', '栾', '暴', '甘', '钭', '厉', '戎', '祖', '武', '符', '刘', '景',
                    '詹', '束', '龙', '叶', '幸', '司', '韶',
                    '郜', '黎', '蓟', '薄', '印', '宿', '白', '怀', '蒲', '邰', '从', '鄂', '索', '咸', '籍', '赖', '卓', '蔺', '屠', '蒙',
                    '池', '乔', '阴', '欎', '胥', '能', '苍',
                    '双', '闻', '莘', '党', '翟', '谭', '贡', '劳', '逄', '姬', '申', '扶', '堵', '冉', '宰', '郦', '雍', '舄', '璩', '桑',
                    '桂', '濮', '牛', '寿', '通', '边', '扈', '燕',
                    '冀', '郏', '浦', '尚', '农', '温', '别', '庄', '晏', '柴', '瞿', '阎', '充', '慕', '连', '茹', '习', '宦', '艾', '鱼',
                    '容', '向', '古', '易', '慎', '戈', '廖', '庾', '终', '暨',
                    '居', '衡', '步', '都', '耿', '满', '弘', '匡', '国', '文', '寇', '广', '禄', '阙', '东', '殴', '殳', '沃', '利', '蔚',
                    '越', '夔', '隆', '师', '巩', '厍', '聂', '晁', '勾', '敖',
                    '融', '冷', '訾', '辛', '阚', '那', '简', '饶', '空', '曾', '毋', '沙', '乜', '养', '鞠', '须', '丰', '巢', '关', '蒯',
                    '相', '查', '後', '荆', '红', '游', '竺', '权', '逯', '盖',
                    '益', '桓', '公', '万俟', '司马', '上官', '欧阳', '夏侯', '诸葛', '闻人', '东方', '赫连', '皇甫', '尉迟', '公羊', '澹台', '公冶',
                    '宗政', '濮阳', '淳于', '单于', '太叔', '申屠',
                    '公孙', '仲孙', '轩辕', '令狐', '钟离', '宇文', '长孙', '慕容', '鲜于', '闾丘', '司徒', '司空', '亓官', '司寇', '仉', '督', '子车',
                    '颛孙', '端木', '巫马', '公西', '漆雕', '乐正',
                    '壤驷', '公良', '拓跋', '夹谷', '宰父', '谷梁', '晋', '楚', '闫', '法', '汝', '鄢', '涂', '钦', '段干', '百里', '东郭', '南门',
                    '呼延', '归', '海', '羊舌', '微生', '岳', '帅', '缑', '亢',
                    '况', '后', '有', '琴', '梁丘', '左丘', '东门', '西门', '商', '牟', '佘', '佴', '伯', '赏', '南宫', '墨', '哈', '谯', '笪',
                    '年', '爱', '阳', '佟', '第五', '言', '福', '百', '家', '姓', '终']
        lst_name = ['茄', '茎', '茅', '林', '枝', '杯', '柜', '析', '板', '松', '枪', '构', '杰', '述', '枕', '丧', '或', '画', '卧', '事',
                    '刺', '枣', '雨', '卖', '矿', '码', '厕', '奔', '奇', '奋', '态', '欧', '垄', '妻',
                    '轰', '顷', '转', '斩', '轮', '软', '到', '非', '叔', '肯', '齿', '些', '虎', '虏', '肾', '贤', '尚', '旺', '具', '果',
                    '味', '昆', '国', '昌', '畅', '明', '易', '昂', '典', '固', '忠', '咐', '呼', '鸣',
                    '咏', '呢', '岸', '岩', '帖', '罗', '帜', '岭', '凯', '败', '贩', '购', '图', '钓', '制', '知', '垂', '牧', '物', '乖',
                    '刮', '秆', '和', '季', '委', '佳', '侍', '供', '使', '例', '版', '侄', '侦', '侧',
                    '凭', '侨', '佩', '货', '依', '的', '迫', '质', '欣', '征', '往', '爬', '彼', '径', '所', '舍', '金', '命', '斧', '爸',
                    '采', '受', '乳', '贪', '念', '贫', '肤', '肺', '肢', '肿', '胀', '朋', '股', '肥',
                    '服', '胁', '周', '昏', '鱼', '兔', '狐', '忽', '狗', '备', '饰', '饱', '饲', '变', '京', '享', '店', '夜', '庙', '府',
                    '底', '剂', '郊', '废', '净', '盲', '放', '刻', '育', '闸', '闹', '郑', '券', '卷',
                    '单', '炒', '炊', '炕', '炎', '炉', '沫', '浅', '法', '泄', '河', '沾', '泪', '油', '泊', '沿', '泡', '注', '泻', '泳',
                    '泥', '沸', '波', '泼', '泽', '治', '怖', '性', '怕', '怜', '怪', '学', '宝', '宗',
                    '定', '宜', '审', '宙', '官', '空', '帘', '实', '试', '郎', '诗', '肩', '房', '诚', '衬', '衫', '视', '话', '诞', '询',
                    '该', '详', '建', '肃', '录', '隶', '居', '届', '刷', '屈', '弦', '承', '孟', '孤',
                    '陕', '降', '限', '妹', '姑', '姐', '姓', '始', '驾', '参', '艰', '线', '练', '组', '细', '驶', '织', '终', '驻', '驼',
                    '绍', '经', '贯', '奏', '春', '帮', '珍', '玻', '毒', '型', '挂', '封', '持', '项',
                    '垮', '挎', '城', '挠', '政', '赴', '赵', '挡', '挺', '括', '拴', '拾', '挑', '指', '垫', '挣', '挤', '拼', '挖', '按',
                    '挥', '挪', '某', '甚', '革', '荐', '巷', '带', '草', '茧', '茶', '荒', '茫', '荡',
                    '荣', '故', '胡', '南', '药', '标', '枯', '柄', '栋', '相', '查', '柏', '柳', '柱', '柿', '栏', '树', '要', '咸', '威',
                    '歪', '研', '砖', '厘', '厚', '砌', '砍', '面', '耐', '耍', '牵', '残', '殃', '轻',
                    '鸦', '皆', '背', '战', '点', '临', '览', '竖', '省', '削', '尝', '是', '盼', '眨', '哄', '显', '哑', '冒', '映', '星',
                    '昨', '畏', '趴', '胃', '贵', '界', '虹', '虾', '蚁', '思', '蚂', '虽', '品', '咽',
                    '骂', '哗', '咱', '响', '哈', '咬', '咳', '哪', '炭', '峡', '罚', '贱', '贴', '骨', '钞', '钟', '钢', '钥', '钩', '卸',
                    '缸', '拜', '看', '矩', '怎', '牲', '选', '适', '秒', '香', '种', '秋', '科', '重',
                    '复', '竿', '段', '便', '俩', '贷', '顺', '修', '保', '促', '侮', '俭', '俗', '俘', '信', '皇', '泉', '鬼', '侵', '追',
                    '俊', '盾', '待', '律', '很', '须', '叙', '剑', '逃', '食', '盆', '胆', '胜', '胞',
                    '胖', '脉', '勉', '狭', '狮', '独', '狡', '狱', '狠', '贸', '怨', '急', '饶', '蚀', '饺', '饼', '弯', '将', '奖', '哀',
                    '亭', '亮', '度', '迹', '庭', '疮', '疯', '疫', '疤', '姿', '亲', '音', '帝', '施',
                    '闻', '阀', '阁', '差', '养', '美', '姜', '叛', '送', '类', '迷', '前', '首', '逆', '总', '炼', '炸', '炮', '烂', '剃',
                    '洁', '洪', '洒', '浇', '浊', '洞', '测', '洗', '活', '派', '洽', '染', '济', '洋',
                    '洲', '浑', '浓', '津']

        row = 1
        col = 0
        for i in range(100):
            firstname = random.choice(fst_name)
            lastname = random.choice(lst_name)
            fullname = firstname + lastname
            worksheet.write(row, col, i)
            worksheet.write(row, col + 1, fullname)
            row += 1
            print("多少条数据%d" % row)

        print("插入数据结束！！！")
        #这一句一定要有，不然该xlsx文件没有成功创建
        workbook.close()

    def del_data(self):
        print("删除数据函数，待完善")

    def update_data(self):
        print("修改数据，待完善")




if __name__=="__main__":
    my_excel_edit=excel_edit()
    my_excel_edit.add_data('newexcel.xlsx','sheet1')